[
  {
    "name": "Long Beach Razor Clam Festival",
    "eventId": "001",
    "url": "http://longbeachrazorclamfestival.com/",
    "city": "Long Beach, WA",
    "state": "WA",
    "coords": {
        "lat": 46.349134,
        "lon": -124.0567037
      },
    "dateStart": "2019-04-21",
    "dateEnd": "2019-04-21",
    "datesCertain": false,
    "type": "seafood",
    "desc": "The event that helped put the Long Beach Peninsula on the map in the 1940s features free razor clam digging lessons, contests, music, an annual chowder cook off and a giant clam fry."
  },
  {
    "name": "Bremerton Blackberry Festival",
    "eventId": "002",
    "url": "http://www.blackberryfestival.org/",
    "city": "Bremerton, WA",
    "state": "WA",
    "coords": {
        "lat": 47.5655493,
        "lon": -122.6276653
      },
    "dateStart": "2018-09-02",
    "dateEnd": "2018-09-04",
    "datesCertain": false,
    "type": "fruit",
    "desc": "The Bremerton Blackberry Festival is held each Labor Day weekend, rain or shine on the picturesque Bremerton Boardwalk. Enjoy food and drink from 130 food, arts & crafts vendors. Be sure to enjoy one or all of the growing list of blackberry treats available at the festival including blackberry “slugs,” blackberry pies, blackberry sodas, blackberry beer and blackberry wine!"
  },
  {
    "name": "National Lentil Festival",
    "eventId": "003",
    "url": "http://www.lentilfest.com/",
    "city": "Pullman, WA",
    "state": "WA",
    "coords": {
        "lat": 46.7292311,
        "lon": -117.1736237
      },
    "dateStart": "2018-08-17",
    "dateEnd": "2018-08-18",
    "datesCertain": true,
    "type": "vegetable",
    "desc": "Since its beginning in 1989, the National Lentil Festival has brought national attention to Pullman. The Palouse region of farmlands in Eastern Washington and Northern Idaho has a reputation for producing the highest quality lentils in the United States. We think that is worth celebrating."
  },
  {
    "name": "Huckleberry Festival",
    "eventId": "004",
    "url": "http://huckleberry-fest.com/",
    "city": "Bingen, WA",
    "state": "WA",
    "coords": {
        "lat": 45.7182243,
        "lon": -121.4716687
      },
    "dateStart": "2018-09-07",
    "dateEnd": "2018-09-09",
    "datesCertain": true,
    "type": "fruit",
    "desc": "Since 1962. A celebration of the varied natural and cultural resources of the Mount Adams country. Parade, entertainment, carnival, food and craft booths and of course huckleberries."
  },
  {
    "name": "Northwest Raspberry Festival",
    "eventId": "005",
    "url": "https://www.facebook.com/events/875215769310346/",
    "city": "Lynden, WA",
    "state": "WA",
    "coords": {
        "lat": 48.9427005,
        "lon": -122.4564467
      },
    "dateStart": "2019-07-20",
    "dateEnd": "2019-07-21",
    "datesCertain": false,
    "type": "fruit",
    "desc": "Come join the Whatcom County community is celebrating and enjoying the greatest raspberry producing region in the world! We are sure you will have a “berry” good time!"
  },
  {
    "name": "Salmon Days",
    "eventId": "006",
    "url": "http://www.salmondays.org/",
    "city": "Issaquah, WA",
    "state": "WA",
    "coords": {
        "lat": 47.533874,
        "lon": -122.036310
      },
    "dateStart": "2018-10-06",
    "dateEnd": "2018-10-07",
    "datesCertain": true,
    "type": "seafood",
    "desc": "The Issaquah Salmon Days is a two-day award-winning festival held in Issaquah, Washington, United States, held from 10am to 6pm on both Saturday and Sunday of the first full weekend of October."
  },
  {
    "name": "Rhubarb Pie Festival",
    "eventId": "007",
    "url": "http://rhubarbpiecapital.com/rhubarb-pie-festival/",
    "city": "Sumner, WA",
    "state": "WA",
    "coords": {
        "lat": 47.2023932,
        "lon": -122.244267
      },
    "dateStart": "2019-07-15",
    "dateEnd": "2019-07-16",
    "datesCertain": false,
    "type": "fruit",
    "desc": "Sumner’s Rhubarb Pie Festival is six weeks of summer fun, including music, sports, plays, classic cars and more.  Be sure to make one or all events for a fun summer in Sumner."
  },
  {
    "name": "Apple Blossom Festival",
    "eventId": "008",
    "url": "http://www.appleblossom.org/",
    "city": "Wenatchee, WA",
    "state": "WA",
    "coords": {
        "lat": 47.423011,
        "lon": -120.3149929
      },
    "dateStart": "2019-04-26",
    "dateEnd": "2019-05-06",
    "datesCertain": false,
    "type": "fruit",
    "desc": "The Washington State Apple Blossom Festival now draws thousands of visitors from around the world during the last weekend in April and the first weekend in May. The 11-day festival includes a Carnival, Golf Tournament, Food Fair, Entertainment, Youth Parade, Youth Day, Art 4 Kidz, Arts & Crafts Fair, and Grand Parade"
  },
  {
    "name": "Cranberry Harvest Festival",
    "eventId": "009",
    "url": "http://www.westportgrayland-chamber.org/pdfs/2018-Cranberry-Harvest-Festival-Poster.pdf",
    "city": "Westport Grayland, WA",
    "state": "WA",
    "coords": {
        "lat": 46.8590383,
        "lon": -124.0995116
      },
    "dateStart": "2018-10-13",
    "dateEnd": "2018-10-14",
    "datesCertain": true,
    "type": "fruit",
    "desc": "Bog tours, Cranberry cook off, and firelight parade"
  },
  {
    "name": "OysterFest",
    "eventId": "010",
    "url": "http://www.oysterfest.org/",
    "city": "Shelton, WA",
    "state": "WA",
    "coords": {
        "lat": 47.2378416,
        "lon": -123.1449564
      },
    "dateStart": "2018-10-06",
    "dateEnd": "2018-10-07",
    "datesCertain": true,
    "type": "seafood",
    "desc": "Oysters, wines, microbrews, live music and so much more come together for two days every year on the first weekend in October. Hosted by the Shelton Skookum Rotary Club Foundation and attended by thousands, OysterFest is home to the West Coast Oyster Shucking Championships and is Washington State’s official seafood festival. The festival also features a popular cook-off, hands-on water quality exhibits, and is itself a giant a food pavilion with nearly 100 unique items on the menu: BBQ oysters, fritters, spring rolls, garlic shrimp, fresh cider and so much more. Better yet, your culinary adventure supports about 100 local non-profit service clubs and organizations, as well as funding scholarships and local community improvement projects. What hidden pearls will you find at OysterFest?"
  },
  {
    "name": "Bellevue Strawberry Festival",
    "eventId": "011",
    "url": "http://www.bellevuestrawberryfestival.org/HOME.asp",
    "city": "Bellevue, WA",
    "state": "WA",
    "coords": {
        "lat": 47.617503,
        "lon": -122.123983
      },
    "dateStart": "2019-06-24",
    "dateEnd": "2019-06-25",
    "datesCertain": false,
    "type": "fruit",
    "desc": "The festival is a revitialization of an old Bellevue tradition, dating back to when strawberry farming was one of the region's most famous activities. The festival has been held in various places around Bellevue, starting (in its recent incarnation) on Main Street in Old Bellevue, moving to the downtown park, and most recently in the Crossroads Park. We celebrate Strawberries and community on the fourth weekend of June. Entertainment, an auto show, vendors, food, and family fun are all highly visible parts of the festivities. And, you will very likely see a strawberry or two (shortcake eating contests, strawberry flats, chocolate covered strawberries, and much more)."
  },
  {
    "name": "Northwest Cherry Festival",
    "eventId": "012",
    "url": "https://thedalleschamber.com/northwest-cherry-festival/",
    "city": "The Dalles, OR",
    "state": "OR",
    "coords": {
        "lat": 45.601333,
        "lon": -121.181823
      },
    "dateStart": "2019-04-27",
    "dateEnd": "2019-04-29",
    "datesCertain": false,
    "type": "fruit",
    "desc": "The Northwest Cherry Festival includes the Gorge’s largest parade, classic car show, a 10k race, and lots of great local music and bands. There’s also cherry sampling with the Oregon Cherry Growers, craft vendors, agriculture job fair, Cherry Idol, and Carnival. You don’t want to miss the crowning of Cherry Festival Royalty at Mid-Columbia Senior Center’s Breakfast Saturday Morning before the parade! The Dalles has much more to offer though the festival alone could keep you busy."
  },
  {
    "name": "Dungeness Crab &amp; Seafood Festival",
    "eventId": "013",
    "url": "http://www.crabfestival.org/",
    "city": "Port Angeles, WA",
    "state": "WA",
    "coords": {
        "lat": 48.119398,
        "lon": -123.430732
      },
    "dateStart": "2018-10-05",
    "dateEnd": "2018-10-07",
    "datesCertain": true,
    "type": "seafood",
    "desc": "The festival celebrates not only the aquaculture, agriculture and maritime traditions of the breathtaking Olympic Peninsula, but brings food, art, music, Native American activities, and children’s events into one spectacular 3-day event for everyone!"
  },
  {
    "name": "Brinnon ShrimpFest",
    "eventId": "014",
    "url": "http://www.brinnonshrimpfest.org/",
    "city": "Brinnon, WA",
    "state": "WA",
    "coords": {
        "lat": 47.7346762,
        "lon": -122.881607
      },
    "dateStart": "2019-05-26",
    "dateEnd": "2019-05-27",
    "datesCertain": false,
    "type": "seafood",
    "desc": "The Brinnon ShrimpFest is a weekend festival located just north of Brinnon celebrating Hood Canal Spot Shrimp and other local seafood. It lures hungry shrimpers from all over the Northwest to fish Hood Canal’s rich waters. We feature craft booths, food booths, belt sander races, exhibits, live music, kids activities and so much more."
  },
  {
    "name": "Chocolate On The Beach Festival",
    "eventId": "015",
    "url": "http://chocolateonthebeachfestival.com/",
    "city": "Aloha, Moclips, Copalis Beach, Copalis Crossing, Pacific Beach, and Seabrook, WA",
    "state": "WA",
    "coords": {
        "lat": 47.2144144,
        "lon": -124.2055585
      },
    "dateStart": "2019-02-22",
    "dateEnd": "2019-02-25",
    "datesCertain": false,
    "type": "dessert",
    "desc": "This is a fun, family festival offering something for every chocolate lover!  There are chocolate vendors, artists, and crafters.  You can attend a cooking class or enter your favorite recipe in the recipe contest.  How about entering an eating contest?  You can do all this and so much more.  Attendees will find chocolate that is gluten free, dairy free, vegan, organic, fair trade, raw and even healthy treats for your favorite furry friends."
  },
  {
    "name": "Northwest Garlic Festival",
    "eventId": "016",
    "url": "http://www.nwgarlicfestival.org/",
    "city": "Ocean Park, WA",
    "state": "WA",
    "coords": {
        "lat": 46.4885498,
        "lon": -124.0355898
      },
    "dateStart": "2019-06-16",
    "dateEnd": "2019-06-17",
    "datesCertain": false,
    "type": "vegetable",
    "desc": "Celebrate the passion for this exalted bulb with the faithful throngs who make their annual pilgrimage to the NW Garlic Festival which is held each June in the seaside community of Ocean Park, Washington, located on the Long Beach Peninsula. This GARLIC Olympics of Gastronomy is not held for the region's GARLIC growing ability. This Festival was born out of love of great, GARLIC laden cuisine!"
  },
  {
    "name": "Sweet Onion Festival",
    "eventId": "017",
    "url": "http://www.sweetonions.org/",
    "city": "Walla Walla, WA",
    "state": "WA",
    "coords": {
        "lat": 46.068626,
        "lon": -118.336651
      },
    "dateStart": "2019-07-21",
    "dateEnd": "2019-07-21",
    "datesCertain": false,
    "type": "vegetable",
    "desc": "When a French soldier brought sweet onion seeds to Walla Walla in the late 1800s, he discovered that this valley’s abundance of water and rich vegetation was the perfect environment for cultivating this crop.  Ever since then, sweet onions have been produced here as a specialty vegetable crop, loved by both locals and visitors alike.  The annual Walla Walla Sweet Onion Festival honors this significant crop through music, games, foods, and much more!  Discover everything there is to do during this exciting weekend and start making your plans to attend today!"
  },
  {
    "name": "Washington State Garlic Fest",
    "eventId": "018",
    "url": "http://wastategarlicfest.com/",
    "city": "Chehalis, WA",
    "state": "WA",
    "coords": {
        "lat": 46.6919535,
        "lon": -122.9581764
      },
    "dateStart": "2018-08-24",
    "dateEnd": "2018-08-26",
    "datesCertain": true,
    "type": "vegetable",
    "desc": "Garlic Themed Cuisine, Artisan & Craft Vendors, Kids Activities, Chef Demonstrations"
  },
  {
    "name": "Mossyrock Blueberry Festival",
    "eventId": "019",
    "url": "https://mossyrockfestivals.org/",
    "city": "Mossyrock, WA",
    "state": "WA",
    "coords": {
        "lat": 46.529421,
        "lon": -122.485441
      },
    "dateStart": "2018-08-03",
    "dateEnd": "2018-08-05",
    "datesCertain": true,
    "type": "fruit",
    "desc": "The Mossyrock Blueberry Festival is a community-led event coordinated by the Mossyrock Area Action League (MAAL), a grass roots, 501(c)3 non-profit organization working on community asset building, economic development, and poverty reduction in East Lewis County, Washington."
  },
  {
    "name": "Everett Sausage Fest",
    "eventId": "020",
    "url": "http://www.everettsausagefest.com/",
    "city": "Everett, WA",
    "state": "WA",
    "coords": {
        "lat": 47.982684,
        "lon": -122.193455
      },
    "dateStart": "2018-09-28",
    "dateEnd": "2018-09-30",
    "datesCertain": true,
    "type": "meat",
    "desc": "The Everett Sausage Festival is a family-oriented weekend fair centered around a Bavarian theme. From our traditional Bavarian Dinner to a variety of food booths, children's games, the Family Entertainment Stage, bingo, carnival, and Bavarian Beer Garden and Stage, there is something for everyone."
  },
  {
    "name": "The Great Wallingford Wurst Festival",
    "eventId": "021",
    "url": "http://www.stbens.net/news-events/wurst-festival/",
    "city": "Seattle, WA",
    "state": "WA",
    "coords": {
        "lat": 47.663826,
        "lon": -122.337005
      },
    "dateStart": "2018-09-21",
    "dateEnd": "2018-09-22",
    "datesCertain": true,
    "type": "meat",
    "desc": "The Great Wallingford Wurst Festival is an Octoberfest style end-of-summer celebration that takes place in September at St. Benedict School. Now in its 33rd year, the festival started as a small fundraiser for the school. Today the festival brings more than 10,000 visitors to the Wallingford neighborhood in one weekend. The Wurst Festival features rides, an array of delicious foods, games for kids of all ages, craft booths, homemade sweets, a book sale, a Biergarten, a raffle, plus live entertainment on an outdoor stage."
  },
  {
    "name": "Onalaska Apple Harvest Festival",
    "eventId": "022",
    "url": "http://www.onalaskaalliance.org/apple-harvest-festival.html",
    "city": "Onalaska, WA",
    "state": "WA",
    "coords": {
        "lat": 46.575642,
        "lon": -122.719213
      },
    "dateStart": "2018-10-04",
    "dateEnd": "2018-10-07",
    "datesCertain": true,
    "type": "fruit",
    "desc": "The Onalaska Apple Harvest Festival is a wonderful opportunity to celebrate the diversity found in Onalaska. The mission of the Onalaska Alliance involves building our local community, and we feel that this event does just that! Our festival started out small, but now we are struggling to contain the awesomeness!"
  },
  {
    "name": "San Juan Island Lavendar Festival",
    "eventId": "023",
    "url": "http://www.pelindabalavender.com/lavender-festival-a/282.htm",
    "city": "Friday Harbor, WA",
    "state": "WA",
    "coords": {
        "lat": 48.508755,
        "lon": -123.099144
      },
    "dateStart": "2019-07-21",
    "dateEnd": "2019-07-22",
    "datesCertain": false,
    "type": "flower",
    "desc": "The annual San Juan Island Lavender Festival, sponsored by and hosted at Pelindaba Lavender Farm the third week of every July. It’s free, fragrant and colorful (well, purple, anyway). Two days of all things lavender: tours of organic fields, drying barn and distillery, commercial kitchen and bakery, and the production center where over 240 products are handcrafted; craft workshops, cooking demos, self-harvesting, picnics in the lavender fields, local music, etc. Lavender fun for the whole family. "
  },
  {
    "name": "Burlington Berry Dairy Days",
    "eventId": "024",
    "url": "https://burlington-chamber.com/community-events/berry-dairy-days/",
    "city": "Burlington, WA",
    "state": "WA",
    "coords": {
        "lat": 48.475209,
        "lon": -122.329046
      },
    "dateStart": "2019-06-15",
    "dateEnd": "2019-06-17",
    "datesCertain": false,
    "type": "fruit",
    "desc": "On the third weekend in June, Burlington will explode into a delicious and exciting place to be. Fresh local strawberry shortcake, spectacular fireworks show, fabulous parades, Kiwanis Salmon BBQ, entertainment stage with live music, nostalgic Berry Cool Car Show and more!"
  },
  {
    "name": "Marysville Strawberry Festival",
    "eventId": "025",
    "url": "http://www.maryfest.org/",
    "city": "Marysville, WA",
    "state": "WA",
    "coords": {
        "lat": 48.051809,
        "lon": -122.173150
      },
    "dateStart": "2019-06-09",
    "dateEnd": "2019-06-17",
    "datesCertain": false,
    "type": "fruit",
    "desc": "Endless fun and entertainment painting the town red - red with strawberries, that is - for this annual celebration of the ripe, red berry that earned Marysville the moniker of The Strawberry City."
  },
  {
    "name": "Burien Wild Strawberry Festival",
    "eventId": "027",
    "url": "http://www.discoverburien.org/events/event/wild-strawberry-festival/",
    "city": "Burien, WA",
    "state": "WA",
    "coords": {
        "lat": 47.466771,
        "lon": -122.351290
      },
    "dateStart": "2019-06-16",
    "dateEnd": "2019-06-16",
    "datesCertain": false,
    "type": "fruit",
    "desc": "Whether you are new to the area or a long time resident, the Wild Strawberry Festival is a tradition like no other. A family friendly annual event with music, games and activities for the kids, artisan craft vendors and the center piece of the event delicious strawberry shortcake. There is so much to see and do all weekend."
  },
  {
    "name": "Penn Cove Musselfest",
    "eventId": "028",
    "url": "http://thepenncovemusselsfestival.com/",
    "city": "Coupeville, WA",
    "state": "WA",
    "coords": {
        "lat": 48.220592,
        "lon": -122.688082
      },
    "dateStart": "2019-03-03",
    "dateEnd": "2019-03-04",
    "datesCertain": false,
    "type": "seafood",
    "desc": "Come join us for the Penn Cove MusselFest—Coupeville’s March tradition. “Bold, briny and blue,” the world famous mussels will be the centerpiece of two days of festivities, including chowder tasting and mussel eating competitions, farm tours and activities for all ages featuring locally-flavored fun."
  },
  {
    "name": "Odessa Deutschesfest",
    "eventId": "029",
    "url": "http://www.deutschesfest.com/",
    "city": "Odessa, WA",
    "state": "WA",
    "coords": {
        "lat": 47.335971,
        "lon": -118.690442
      },
    "dateStart": "2018-09-13",
    "dateEnd": "2018-09-16",
    "datesCertain": true,
    "type": "cultural",
    "desc": "German music plays its way into your ears, sausage and strudel tease your appetite, and the fun, excitement, and friendliness capture your heart. This four day event is more than just a festival, it's an experience! Every third full weekend in September, the small community of Odessa attracts thousands of visitors and adventurers to its famous Deutschesfest. Sporting an authentic local German Band - The Oom Pas & Mas, German Food, Crafts, and many exciting events, Odessa has made a name for itself by taking pride in its German Heritage. All the preparation for Deutschesfest is done by volunteers throughout the town."
  },
  {
    "name": "Kent Cornucopia Days",
    "eventId": "030",
    "url": "http://kcdays.com/",
    "city": "Kent, WA",
    "state": "WA",
    "coords": {
        "lat": 47.386601,
        "lon": -122.237388
      },
    "dateStart": "2019-07-13",
    "dateEnd": "2019-07-15",
    "datesCertain": false,
    "type": "other",
    "desc": "The nationally recognized and award-winning summer family festival is in Kent, just south of Seattle. The street fair alone is huge – over 600 vendors from around the coutry! Other main events include the farmers market, fine crafts market, Dragon Boat Races, a soccer tournament, 5K fun run, and more!"
  },
  {
    "name": "Huckleberry Festival",
    "eventId": "031",
    "url": "http://donnellychamber.com/events/huckleberry-festival/",
    "city": "Donnelly, ID",
    "state": "ID",
    "coords": {
        "lat": 44.731529,
        "lon": -116.078273
      },
    "dateStart": "2018-08-10",
    "dateEnd": "2018-08-12",
    "datesCertain": true,
    "type": "fruit",
    "desc": "Join us each August for a fun-filled weekend to celebrate all things huckleberry! The Huckleberry Festival is held on the second weekend in August each year and features 40+ craft and food vendors and a parade."
  },
  {
    "name": "Vashon Island Strawberry Festival",
    "eventId": "032",
    "url": "http://www.vashonchamber.com/pages/vashon-island-strawberry-festival",
    "city": "Vashon Island, WA",
    "state": "WA",
    "coords": {
        "lat": 47.452316,
        "lon": -122.460433
      },
    "dateStart": "2019-07-20",
    "dateEnd": "2019-07-22",
    "datesCertain": false,
    "type": "fruit",
    "desc": "There is something for all ages and interests during the fun-filled, busy weekend!  A grand-parade, classic car show and parade, several music stages, vendor booths, alternative carnival, local artists, and street dances are all part of the fun.  Toss in pancake breakfasts, a rocking beer garden, a fun run, the firefighter's challenge, the Miss Lucy Dinner, and loads of children's activities. You will have something to do morning til night!"
  },
  {
    "name": "Skagit River Salmon Festival",
    "eventId": "026",
    "url": "http://skagitriverfest.org/",
    "city": "Mount Vernon, WA",
    "state": "WA",
    "coords": {
        "lat": 48.419387,
        "lon": -122.343712
      },
    "dateStart": "2018-09-08",
    "dateEnd": "2018-09-08",
    "datesCertain": true,
    "type": "seafood",
    "desc": "Established in 2012, the Skagit River Salmon Festival is a 501(c)(3) nonprofit organization, whose purpose is to inspire conservation of the Skagit watershed’s incredible resources through a community celebration showcasing the Skagit River, its rich history, and vast natural and cultural resources. "
  },
  {
    "name": "Viking Fest",
    "eventId": "033",
    "url": "http://www.vikingfest.org/",
    "city": "Poulsbo, WA",
    "state": "WA",
    "coords": {
        "lat": 47.734414,
        "lon": -122.646110
      },
    "dateStart": "2019-05-18",
    "dateEnd": "2019-05-20",
    "datesCertain": false,
    "type": "cultural",
    "desc": "Poulsbo’s Viking Fest is a celebration of Norway’s Constitution Day of May 17 (in Norwegian, “Syttende mai”). In Norway, it is a festival of flags and colorful processions, where children walk to the music of marching bands. Traditional Norwegian costumes are a prominent and common part of the celebrations. The festivities last from early morning to late at night. Viking Fest also features a donut eating contest and a lutefisk eating contest!"
  },
  {
    "name": "University District Street Fair",
    "eventId": "034",
    "url": "http://udistrictstreetfair.org/",
    "city": "Seattle, WA",
    "state": "WA",
    "coords": {
        "lat": 47.661291,
        "lon": -122.313126
      },
    "dateStart": "2019-05-19",
    "dateEnd": "2019-05-20",
    "datesCertain": false,
    "type": "general",
    "desc": "The U District StreetFair is the longest running festival of its kind in the nation. In 1970, community leaders established the StreetFair to heal our community after protests, street riots, and violence disrupted the community. Originally a blanket-vending event with lots of free live music, the U District StreetFair has developed into a regional event that features products that are hand-made by individual artists and craftsmen in the USA. In celebration of the international flavor of our community, we invite food vendors to participate along with our many local restaurants to supply an around-the-world food experience."
  },
  {
    "name": "Longview Squirrel Fest",
    "eventId": "035",
    "url": "http://lvsquirrelfest.com/",
    "city": "Longview, WA",
    "state": "WA",
    "coords": {
        "lat": 46.143022,
        "lon": -122.939523
      },
    "dateStart": "2018-08-18",
    "dateEnd": "2018-08-18",
    "datesCertain": true,
    "type": "animal",
    "desc": "The Longview Squirrel Fest is a one-day festival in honor or our furry friends. A wide range of vendors and entertainment will be present to make the day as fun and active, or relaxing as you would want it. The kids will enjoy fun things like a tight rope, juggling, diablo, flower-sticks, pole balance, walking globe, stilts, Poi balls, unicycle, plate spin and much more!!! Everyone can satisfy their craving for pizza, hot dogs and cotton candy, clowns, tee-shirt cannons, demonstrations, arts and crafts, and even giant squirrels."
  },
  {
    "name": "Mount Vernon Tulip Festival Street Fair",
    "eventId": "036",
    "url": "http://www.mountvernondowntown.org/event/tulip-festival-street-fair/",
    "city": "Mount Vernon, WA",
    "state": "WA",
    "coords": {
        "lat": 48.419452,
        "lon": -122.337825
      },
    "dateStart": "2019-04-19",
    "dateEnd": "2019-04-21",
    "datesCertain": true,
    "type": "flower",
    "desc": "This annual event is part of the month long Tulip Festival. The Street Fair runs Friday through Sunday, attracting vendors, artists, crafts people and visitors far and wide."
  },
  {
    "name": "Colorama Festival",
    "eventId": "037",
    "url": "http://www.grandcouleedam.org/colorama.html",
    "city": "Grand Coulee, WA",
    "state": "WA",
    "coords": {
        "lat": 47.937155,
        "lon": -119.018571
      },
    "dateStart": "2019-05-11",
    "dateEnd": "2019-05-13",
    "datesCertain": false,
    "type": "other",
    "desc": "This festival is a hometown favorite and draws people from the Grand Coulee Dam Area and the surrounding towns as well. It is a popular event for former residents of the area to return to year after year. The festival is held annually on Mother's Day weekend in beautiful North Dam Park (between Grand Coulee and Electric City). Activities for the weekend include a carnival, two Pro-West Rodeos, a Color Run, a parade down main street, arts and crafts vendors, food vendors, a beer garden, and a prize button raffle drawing with grand prizes."
  },
  {
    "name": "McMenamins UFO Festival",
    "eventId": "038",
    "url": "http://ufofest.com/",
    "city": "McMinnville, OR",
    "state": "OR",
    "coords": {
        "lat": 45.210179,
        "lon": -123.194281
      },
    "dateStart": "2019-05-16",
    "dateEnd": "2019-05-18",
    "datesCertain": true,
    "type": "supernatural",
    "desc": "UFO skeptics, experts and wine-country daytrippers alike are invited to enjoy events throughout the weekend – such as an outdoor festival tent and UFO gift shop, live music, an outlandish alien costume parade, a pet costume contest, a performance by Willamette Radio Workshop and much more!"
  },
  {
    "name": "West Coast Giant Pumpkin Regatta",
    "eventId": "039",
    "url": "https://www.tualatinoregon.gov/pumpkinregatta",
    "city": "Tualatin, OR",
    "state": "OR",
    "coords": {
        "lat": 45.382771,
        "lon": -122.761898
      },
    "dateStart": "2018-10-20",
    "dateEnd": "2018-10-20",
    "datesCertain": true,
    "type": "fruit",
    "desc": "If you’ve never been to the West Coast Giant Pumpkin Regatta odds are you’ve never seen anyone sit inside a giant pumpkin let alone race one across a lake dressed as a superhero or the tooth fairy. the award-winning West Coast Giant Pumpkin Regatta has become Oregon's best October event. Spectators come from not only  the Pacific Northwest but also from all over the United States and Canada. Admission to the festival is free as are most of the activities. Food and souvenirs will be available for purchase."
  },
  {
    "name": "Mushroom Festival",
    "eventId": "040",
    "url": "http://www.mountpisgaharboretum.com/festivals-events/2017-mushroom-festival/",
    "city": "Eugene, OR",
    "state": "OR",
    "coords": {
        "lat": 44.007680,
        "lon": -122.980761
      },
    "dateStart": "2018-10-29",
    "dateEnd": "2018-10-29",
    "datesCertain": true,
    "type": "vegetable",
    "desc": "The Mushroom Festival is a family-friendly all-day event with something for everyone to enjoy. Features: A huge mushroom exhibit where you can learn about over 300 local species, live music on our stage from 10am – 5pm, hay rides and guided nature walks around our beautiful site, a kids booth with face painting and nature crafts for children, culinary demonstrations featuring delicious mushroom dishes, the Scarecrow Contest where you can vote for your favorites in several categories. In addition, the festival brings in dozens of booths and vendors for your enjoyment. They feature food and drink, arts and crafts, mushroom vendors, a variety of plant sellers, and local non-profits that support nature education and habitat restoration."
  },
  {
    "name": "Lake City Summer Festival",
    "eventId": "041",
    "url": "https://lakecitysummerfest.com/",
    "city": "Seattle, WA",
    "state": "WA",
    "coords": {
        "lat": 47.720332,
        "lon": -122.298022
      },
    "dateStart": "2018-08-04",
    "dateEnd": "2018-08-04",
    "datesCertain": true,
    "type": "seafood",
    "desc": "Previously SalmonFest Seattle, the Lake City Summer Festival & Parade features a salmon bake, food trucks, music, vendors, a beer garden, and a car show."
  },
  {
    "name": "Ballard Seafood Fest",
    "eventId": "042",
    "url": "https://seafoodfest.org/",
    "city": "Seattle, WA",
    "state": "WA",
    "coords": {
        "lat": 47.668737,
        "lon": -122.384784
      },
    "dateStart": "2019-07-13",
    "dateEnd": "2019-07-15",
    "datesCertain": false,
    "type": "seafood",
    "desc": "What started as a two-hour dinner in 1971 is now an iconic two+ day event that draws over 60,000 people. A music stage featuring popular local bands, a family entertainment stage, a beer garden, and arts and crafts vendors."
  },
  {
    "name": "Yelm UFO Festival",
    "eventId": "043",
    "url": "http://yelmufofest.com/",
    "city": "Yelm, WA",
    "state": "WA",
    "coords": {
        "lat": 46.939326,
        "lon": -122.599091
      },
    "dateStart": "2019-07-27",
    "dateEnd": "2019-07-29",
    "datesCertain": false,
    "type": "supernatural",
    "desc": "The UFO Festival is a celebration of all things UFO and alien, open to skeptics and believers alike!  Some highlights: Food trucks, beer garden, live music & entertainment on the festival stage, vendors, and more! Lots to see and do!"
  }
]
